export const pieData = {
	'2019': [
		{ name: 'Денег не хватает даже на продукты питания', value: 7 },
		{ name: 'Вызывает затруднение покупка одежды', value: 19.7 },
		{ name: 'Вызывает затруднение покупка вещей длительного пользования', value: 31.7 },
		{ name: 'Вызывает затруднение покупка дорогих вещей', value: 34.3 },
		{ name: 'Могут позволить себе приобретать дорогие вещи', value: 2 },
		{ name: 'Нет ответа', value: 5 }
	], '2018': [
		{ name: 'Денег не хватает даже на продукты питания', value: 9 },
		{ name: 'Вызывает затруднение покупка одежды', value: 29.7 },
		{ name: 'Вызывает затруднение покупка вещей длительного пользования', value: 11.5 },
		{ name: 'Вызывает затруднение покупка дорогих вещей', value: 14 },
		{ name: 'Могут позволить себе приобретать дорогие вещи', value: 8 },
		{ name: 'Нет ответа', value: 12.3 }
	], '2017': [
		{ name: 'Денег не хватает даже на продукты питания', value: 19.6 },
		{ name: 'Вызывает затруднение покупка одежды', value: 19.3 },
		{ name: 'Вызывает затруднение покупка вещей длительного пользования', value: 10 },
		{ name: 'Вызывает затруднение покупка дорогих вещей', value: 28.5 },
		{ name: 'Могут позволить себе приобретать дорогие вещи', value: 5 },
		{ name: 'Нет ответа', value: 4.7 }
	]
};

export const horizontalBarData = [
  {name: 'Развитие здравоохранения', value: 73.1},
  {name: 'Развитие образования', value: 74},
  {name: 'Социальная поддержка граждан', value: 72.1},
  {name: 'Развитие физической культуры и спорта', value: 73.1},
  {name: 'Обеспечение законност, порядка и безопсности', value: 97.7},
  {name: 'Развитие систем коммунальной инфраструктуры', value: 58.2},
  {name: 'Развитие сферы культуры и туризма', value: 78.1},
  {name: 'Обеспечение достойным жильем и ЖКУ', value: 68.3},
  {name: 'Благоустройство и охрана окружающей среды', value: 66.5},
  {name: 'Развитие предпринимательства и потребительского рынка', value: 1},
  {name: 'Повышение  эффективности государственного управления', value: 77.8},
  {name: 'Экономическое и социальное развитие территорий', value: 69.6},
  {name: 'Создание условий для обеспечения общественного согласия', value: 75},
];

export const lineData = [
  {
    year: 2010,
    'Денег не хватает даже на продукты питания': 18,
    'Вызывает затруднение покупка одежды': 24,
    'Вызывает затруднение покупка вещей длительного пользования': 50,
    'Вызывает затруднение покупка дорогих вещей': 47,
    'Могут позволить себе приобретать дорогие вещи': 36,
  },
  {
    year: 2011,
    'Денег не хватает даже на продукты питания': 12,
    'Вызывает затруднение покупка одежды': 23,
    'Вызывает затруднение покупка вещей длительного пользования': 40,
    'Вызывает затруднение покупка дорогих вещей': 41,
    'Могут позволить себе приобретать дорогие вещи': 46
  },
  {
    year: 2012,
    'Денег не хватает даже на продукты питания': 12,
    'Вызывает затруднение покупка одежды': 23,
    'Вызывает затруднение покупка вещей длительного пользования': 40,
    'Вызывает затруднение покупка дорогих вещей': 41,
    'Могут позволить себе приобретать дорогие вещи': 46
  },
  {
    year: 2013,
    'Денег не хватает даже на продукты питания': 18,
    'Вызывает затруднение покупка одежды': 24,
    'Вызывает затруднение покупка вещей длительного пользования': 49,
    'Вызывает затруднение покупка дорогих вещей': 47,
    'Могут позволить себе приобретать дорогие вещи': 37
  },
  {
    year: 2014,
    'Денег не хватает даже на продукты питания': 17,
    'Вызывает затруднение покупка одежды': 24,
    'Вызывает затруднение покупка вещей длительного пользования': 47,
    'Вызывает затруднение покупка дорогих вещей': 46,
    'Могут позволить себе приобретать дорогие вещи': 39
  },
  {
    year: 2015,
    'Денег не хватает даже на продукты питания': 10,
    'Вызывает затруднение покупка одежды': 22,
    'Вызывает затруднение покупка вещей длительного пользования': 35,
    'Вызывает затруднение покупка дорогих вещей': 38,
    'Могут позволить себе приобретать дорогие вещи': 50
  },
  {
    year: 2016,
    'Денег не хватает даже на продукты питания': 8,
    'Вызывает затруднение покупка одежды': 21,
    'Вызывает затруднение покупка вещей длительного пользования': 33,
    'Вызывает затруднение покупка дорогих вещей': 36,
    'Могут позволить себе приобретать дорогие вещи': 52
  },
  {
    year: 2017,
    'Денег не хватает даже на продукты питания': 11,
    'Вызывает затруднение покупка одежды': 22,
    'Вызывает затруднение покупка вещей длительного пользования': 38,
    'Вызывает затруднение покупка дорогих вещей': 40,
    'Могут позволить себе приобретать дорогие вещи': 47
  },
  {
    year: 2018,
    'Денег не хватает даже на продукты питания': 19,
    'Вызывает затруднение покупка одежды': 23,
    'Вызывает затруднение покупка вещей длительного пользования': 50,
    'Вызывает затруднение покупка дорогих вещей': 48,
    'Могут позволить себе приобретать дорогие вещи': 37
  }
];